Repository: CodeH-top/Menu11-For-Git
Catalog: src/Menu11.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# GitStatusDetected
source: Git for Windows detected
zh_cn: 已检测到 Git for Windows

# GitStatusNotDetected
source: Git for Windows not detected
zh_cn: 未检测到 Git for Windows

source: Not detected
zh_cn: 未检测到

source: Not available
zh_cn: 不可用

# VersionFormat
source: Version {0}
zh_cn: 版本 {0}

# EnabledSummaryFormat
source: {0} of {1} enabled
zh_cn: 已启用 {0}/{1} 项

# SourceMachineRegistry64
source: Machine registry (64-bit)
zh_cn: 计算机注册表（64 位）

# SourceMachineRegistry32
source: Machine registry (32-bit)
zh_cn: 计算机注册表（32 位）

# SourceUserRegistry64
source: User registry (64-bit)
zh_cn: 用户注册表（64 位）

# SourceUserRegistry32
source: User registry (32-bit)
zh_cn: 用户注册表（32 位）

# SourcePath
source: PATH environment
zh_cn: PATH 环境变量

# SourceCommonLocation
source: Common installation location
zh_cn: 常用安装位置

# SourceUserSelected
source: User-selected location
zh_cn: 用户选择的位置

# SourceUnknown
source: Unknown
zh_cn: 未知

# NavGeneral.Content
source: General
zh_cn: 常规

# NavGitMenu.Content
source: Git Menu
zh_cn: Git 菜单

# NavAbout.Content
source: About
zh_cn: 关于

# GeneralPageTitle.Text
source: General
zh_cn: 常规

# GeneralSectionMenu11.Text
source: Settings
zh_cn: 设置

# EnableMenuLabel.Text
source: Enable Menu11 context menu
zh_cn: 启用 Menu11 右键菜单

# EnableMenuToggle.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Enable Menu11 context menu
zh_cn: 启用 Menu11 右键菜单

# GeneralCommandsSection.Text
source: General commands
zh_cn: 常用命令

# GitBashLabel.Text
source: Git Bash Here
zh_cn: 在此处打开 Git Bash

# GitBashToggle.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Git Bash Here
zh_cn: 在此处打开 Git Bash

# GitGuiLabel.Text
source: Git GUI Here
zh_cn: 在此处打开 Git GUI

# GitGuiToggle.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Git GUI Here
zh_cn: 在此处打开 Git GUI

# ApplicationSection.Text
source: Application
zh_cn: 应用程序

# SettingsMenuLabel.Text
source: Show Settings in Git menu
zh_cn: 在 Git 菜单中显示“设置”

# SettingsMenuToggle.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Show Settings in Git menu
zh_cn: 在 Git 菜单中显示设置

# LanguageLabel.Text
source: Language
zh_cn: 语言

# LanguageDescription.Text
source: Display language for Menu11 and Explorer commands
zh_cn: Menu11 设置中心与资源管理器命令的显示语言

# LanguageSystemOption.Content
source: System language
zh_cn: 系统语言

# LanguageChineseOption.Content
source: Simplified Chinese
zh_cn: 简体中文

# ExplorerSection.Text
source: Actions
zh_cn: 操作

# RefreshExplorerButtonLabel.Text
source: Refresh Explorer
zh_cn: 刷新资源管理器

# RestoreDefaultsButtonLabel.Text
source: Restore defaults
zh_cn: 恢复默认设置

# ExplorerRefreshedTitle
source: Explorer refreshed
zh_cn: 已刷新资源管理器

# ExplorerRefreshedMessage
source: Context menu settings are ready for the next Explorer menu.
zh_cn: 新的右键菜单设置将在下次打开资源管理器菜单时生效。

# RestoreDefaultsDialogTitle
source: Restore default settings?
zh_cn: 恢复默认设置？

# RestoreDefaultsDialogContent
source: Your Menu11 commands, language, and Explorer preferences will be reset.
zh_cn: 这将重置 Menu11 命令、语言和资源管理器偏好。

# RestoreDefaultsDialogPrimary
source: Restore
zh_cn: 恢复

source: Cancel
zh_cn: 取消

# DefaultsRestoredTitle
source: Defaults restored
zh_cn: 已恢复默认设置

# LanguageSavedTitle
source: Language saved
zh_cn: 语言设置已保存

# LanguageRestartMessage
source: Restart Menu11 for Git to update the Settings interface. Explorer commands use the new language immediately.
zh_cn: 请重新启动 Menu11 for Git 以更新设置界面；资源管理器命令会立即使用新语言。

# GitMenuPageTitle.Text
source: Git Menu
zh_cn: Git 菜单

# SelectAllButtonLabel.Text
source: Select all
zh_cn: 全选

# ClearAllButtonLabel.Text
source: Clear all
zh_cn: 全部清除

# RepositorySection.Text
source: Repository
zh_cn: 仓库

# FileSection.Text
source: File
zh_cn: 文件

# OtherSection.Text
source: Other
zh_cn: 其他

# DetectedInstallationSection.Text
source: Detected installation
zh_cn: 检测到的安装

# GitLocationLabel.Text
source: Location
zh_cn: 位置

# GitVersionLabel.Text
source: Version
zh_cn: 版本

# GitSourceLabel.Text
source: Source
zh_cn: 来源

# InstallationLocationSection.Text
source: Installation location
zh_cn: 安装位置

# GitPathBox.Header
source: Git for Windows folder
zh_cn: Git for Windows 文件夹

# GitPathBox.PlaceholderText
source: Automatic detection
zh_cn: 自动检测

# BrowseButtonLabel.Text
source: Browse
zh_cn: 浏览

# UsePathButtonLabel.Text
source: Use this location
zh_cn: 使用此位置

# AutomaticButtonLabel.Text
source: Use automatic detection
zh_cn: 使用自动检测

# DetectAgainButtonLabel.Text
source: Detect again
zh_cn: 重新检测

source: Automatic detection enabled
zh_cn: 已启用自动检测

# GitLocationSaved
source: Git for Windows location saved
zh_cn: 已保存 Git for Windows 位置

# GitLocationNotFound
source: No Git for Windows installation was found at this location.
zh_cn: 在此位置未找到 Git for Windows。

# CommandIconsLabel.Text
source: Command icons
zh_cn: 命令图标

# CommandIconsDescription.Text
source: Show Menu11 icons beside Explorer commands
zh_cn: 在资源管理器命令旁显示 Menu11 图标

# CommandIconsToggle.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Command icons
zh_cn: 命令图标

# AboutDescription.Text
source: A lightweight Windows 11 modern context menu extension for Git for Windows.
zh_cn: 面向 Git for Windows 的轻量级 Windows 11 原生现代右键菜单扩展。

# AboutDisclaimer.Text
source: Menu11 for Git is an independent third-party project and is not affiliated with or endorsed by the Git Project or Git for Windows.
zh_cn: Menu11 for Git 是独立的第三方项目，与 Git Project 或 Git for Windows 没有关联，也未获得其认可或背书。

# GitHubButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Open the Menu11 for Git project on GitHub
zh_cn: 在 GitHub 打开 Menu11 for Git 项目

# UpdatesButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Check the latest verified GitHub Release
zh_cn: 检查并验证最新 GitHub Release

# LicenseButtonLabel.Text
source: License
zh_cn: 许可证

# UpdatesButtonLabel.Text
source: Check for updates
zh_cn: 检查更新

# UnableOpenProjectPage
source: Unable to open the project page.
zh_cn: 无法打开项目页面。

# UnableOpenReleasesPage
source: Unable to open the releases page.
zh_cn: 无法打开发布页面。

# UnableOpenLicense
source: Unable to open the installed license file.
zh_cn: 无法打开已安装的许可证文件。

# LicenseDialogTitle
source: MIT License
zh_cn: MIT 许可证

source: Close
zh_cn: 关闭

source: Action failed
zh_cn: 操作失败

# UpdatesSection.Text
source: Updates
zh_cn: 更新

# AutomaticUpdatesLabel.Text
source: Check for updates when Menu11 starts
zh_cn: Menu11 启动时检查更新

# AutomaticUpdatesDescription.Text
source: Checks GitHub Releases only while the settings center is open
zh_cn: 仅在设置中心打开期间检查 GitHub Release

source: Check for updates when Menu11 starts
zh_cn: Menu11 启动时检查更新

# CheckingForUpdatesTitle
source: Checking for updates
zh_cn: 正在检查更新

# CheckingForUpdatesMessage
source: Contacting the Menu11 for Git release page...
zh_cn: 正在连接 Menu11 for Git 发布页面...

# UpToDateTitle
source: Menu11 is up to date
zh_cn: Menu11 已是最新版本

# UpToDateMessage
source: Version {0} is the latest published version.
zh_cn: 版本 {0} 是当前最新公开版本。

# UpdateAvailableTitle
source: Update available
zh_cn: 发现新版本

# UpdateAvailableMessage
source: Menu11 for Git {1} is available. You are using {0}. The installer will be downloaded from GitHub and verified with SHA-256 before it starts.
zh_cn: Menu11 for Git {1} 已发布，当前版本为 {0}。安装程序将从 GitHub 下载，并在启动前完成 SHA-256 校验。

source: Download and install
zh_cn: 下载并安装

# DownloadingUpdateTitle
source: Downloading update
zh_cn: 正在下载更新

# DownloadingUpdateMessage
source: Downloading the installer and verifying its SHA-256 checksum...
zh_cn: 正在下载安装程序并校验 SHA-256...

# UpdateAvailableLaterMessage
source: Version {0} remains available. Check again when you are ready to install it.
zh_cn: 版本 {0} 仍可安装，准备好后可再次检查更新。

# UpdateCancelledTitle
source: Update cancelled
zh_cn: 已取消更新

# UpdateCancelledMessage
source: No installer was started.
zh_cn: 没有启动任何安装程序。

# UpdateFailedTitle
source: Unable to verify the update
zh_cn: 无法验证更新

# UpdateFailedMessage
source: Check your internet connection and try again. Menu11 will never run an installer that fails release or SHA-256 validation.
zh_cn: 请检查网络连接后重试。未通过 Release 或 SHA-256 校验的安装程序绝不会被运行。

# UpdateBusyTitle
source: Update check already running
zh_cn: 更新检查正在运行

# UpdateBusyMessage
source: Wait for the current check to finish, then try again.
zh_cn: 请等待当前检查完成后再试。
